// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   DmpstoreStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell dmpstore command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_DMPSTORE_DUMP_ONE_VAR      #language eng  "Dump Variable %hs\n"

#string STR_DMPSTORE_DUMP              #language eng  "Dump Variable Stores\n"

#string STR_DMPSTORE_DELETE_ONE_VAR    #language eng  "Delete Variable %hs\n"

#string STR_DMPSTORE_DELETE            #language eng  "Delete Variable Stores\n"

#string STR_DMPSTORE_DELETE_ERR        #language eng  "Failed to delete variable\n"

#string STR_DMPSTORE_SAVE_ONE_VAR      #language eng  "Save Variable %hs\n"

#string STR_DMPSTORE_SAVE              #language eng  "Save Variable Stores\n"

#string STR_DMPSTORE_SAVE_ERR          #language eng  "Failed to write file\n"

#string STR_DMPSTORE_LOAD              #language eng  "Load and Set Variables\n"

#string STR_DMPSTORE_LOAD_ERR          #language eng  "Failed to set variable\n"

#string STR_DMPSTORE_LOAD_ERR2         #language eng  "Incorrect file format\n"

#string STR_DMPSTORE_ENTER             #language eng  "Press ENTER to continue:"

#string STR_DMPSTORE_TEMP              #language eng  "\r%*a\r"

#string STR_DMPSTORE_VAR               #language eng  "Variable %hs '%hg:%hs' DataSize = %x\n"

#string STR_DMPSTORE_VAR_NOT_FOUND     #language eng  "Variable %hs not found\n"

#string STR_DMPSTORE_VAR_EMPTY         #language eng  "Variable Stores are empty\n"

#string STR_DMPSTORE_LINEHELP		       #language eng  "Displays all EFI NVRAM variables"

#string STR_DMPSTORE_VERBOSEHELP	     #language eng  "Displays all EFI NVRAM variables.\n"
                                                      "\n"
                                                      "DMPSTORE [-b] [-d] [Variable]\n"
                                                      "DMPSTORE [Variable] -s file\n"
                                                      "DMPSTORE [Variable] -l file\n"
                                                      "\n"
                                                      "    -b       - Display one screen at a time\n"
                                                      "    Variable - Display the specified variable name\n"
                                                      "    -d       - Delete variables\n"
                                                      "    -s       - Save variables to file\n"
                                                      "    -l       - Load and set variables from file\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. If the 'variable' parameter is not specified, all variables will be\n"
                                                      "       displayed.\n"
                                                      "    2. The variable name is not case sensitive.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "* To display all EFI NVRAM variables:\n"
                                                      "  Shell> dmpstore\n"
                                                      "\n"
                                                      "  Dump NVRAM\n"
                                                      "\n"
                                                      "  Variable RT+BS 'Efi:BootCurrent' DataSize = 2\n"
                                                      "   00000000: FF FF                                           *..*\n"
                                                      "  Variable NV+RT+BS 'Efi:LangCodes' DataSize = 2A\n"
                                                      "   00000000: 65 6E 67 65 6E 6D 61 6E-67 63 68 69 7A 68 6F 64 *engenmangchizhod*\n"
                                                      "   00000010: 65 75 67 65 6D 67 65 72-67 6D 68 67 6F 68 66 72 *eugemgergmhgohfr*\n"
                                                      "   00000020: 61 66 72 65 66 72 6D 66-72 6F                   *afrefrmfro*\n"
                                                      "  Variable NV+RT+BS 'Efi:Lang' DataSize = 3\n"
                                                      "   00000000: 65 6E 67                                        *eng*\n"
                                                      "  ...\n"
                                                      "  Variable NV+BS 'ShellAlias:copy' DataSize = 6\n"
                                                      "   00000000: 63 00 70 00 00 00                                *c.p...*\n"
                                                      "  Variable NV+BS 'SEnv:path' DataSize = 4\n"
                                                      "   00000000: 2E 00 00 00                                      *....*\n"
                                                      "\n"
                                                      "* To display the Boot0000 EFI NVRAM variable:\n"
                                                      "  Shell> dmpstore Boot0000\n"
												                              "  Dump Variable Boot0000\n"
                                                      "  Variable NV+RT+BS 'Efi:Boot0000' DataSize = 48\n"
                                                      "  00000000: 01 00 00 00 30 00 42 00-6F 00 6F 00 74 00 30 00  *....0.B.o.o.t.0.*\n"
                                                      "  00000010: 30 00 30 00 30 00 00 00-01 04 14 00 B1 18 C5 58  *0.0.0..........X*\n"
                                                      "  00000020: F3 76 D4 11 BC EA 00 80-C7 3C 88 81 01 04 18 00  *.v.......<......*\n"
                                                      "  00000030: 2F A9 95 0C 06 A0 D4 11-BC FA 00 80 C7 3C 88 81  */............<..*\n"
                                                      "  00000040: 00 00 00 00 7F FF 04 00-                         *........*\n"
